; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_2 type_1)
 (:predicates (pred_1 ?v2 - type_2 ?v8 - type_3)
 	      (pred_4 ?v5 - object ?v8 - type_3)
	      (pred_2 ?v2 - type_2 ?v7 - type_1)
	      (pred_3 ?v2 - type_2 ?v5 - object ?v7 - type_1))

   (:action op_2
       :parameters  (?v2 - type_2 ?v4 ?v6 - type_3)
       :precondition (and  (pred_1 ?v2 ?v4))
       :effect (and  (pred_1 ?v2 ?v6)
		     (not (pred_1 ?v2 ?v4))))

   (:action op_1
       :parameters (?v2 - type_2 ?v1 - object ?v3 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_4 ?v1 ?v3) (pred_1 ?v2 ?v3) (pred_2 ?v2 ?v7))
       :effect (and (pred_3 ?v2 ?v1 ?v7)
		    (not (pred_4 ?v1 ?v3)) 
		    (not (pred_2 ?v2 ?v7))))

   (:action op_3
       :parameters (?v2 - type_2 ?v1 - object ?v3 - type_3 ?v7 - type_1)
       :precondition  (and  (pred_3 ?v2 ?v1 ?v7) (pred_1 ?v2 ?v3))
       :effect (and (pred_4 ?v1 ?v3)
		    (pred_2 ?v2 ?v7)
		    (not (pred_3 ?v2 ?v1 ?v7)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_08 - type_2
obj_07 obj_01 - type_1
obj_03 obj_09 obj_02 obj_05 - type_3
obj_06 obj_10 obj_04 - object)
(:init
(pred_1 obj_08 obj_02)
(pred_2 obj_08 obj_07)
(pred_2 obj_08 obj_01)
(pred_4 obj_06 obj_09)
(pred_4 obj_10 obj_09)
(pred_4 obj_04 obj_02)
)
(:goal
(and
(pred_4 obj_06 obj_03)
(pred_4 obj_10 obj_05)
(pred_4 obj_04 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_08 ?b obj_01))))
)
)

; plan
1. (op_1 obj_08 obj_04 obj_02 obj_07)
   deleted: (pred_4 obj_04 obj_02) (pred_2 obj_08 obj_07)
   added: (pred_3 obj_08 obj_04 obj_07)
   goals met: 0 of 3
2. (op_2 obj_08 obj_02 obj_05)
   deleted: (pred_1 obj_08 obj_02)
   added: (pred_1 obj_08 obj_05)
   goals met: 0 of 3
3. (op_3 obj_08 obj_04 obj_05 obj_07)
   deleted: (pred_3 obj_08 obj_04 obj_07)
   added: (pred_4 obj_04 obj_05) (pred_2 obj_08 obj_07)
   goals met: 1 of 3
4. (op_2 obj_08 obj_05 obj_09)
   deleted: (pred_1 obj_08 obj_05)
   added: (pred_1 obj_08 obj_09)
   goals met: 1 of 3
5. (op_1 obj_08 obj_06 obj_09 obj_07)
   deleted: (pred_4 obj_06 obj_09) (pred_2 obj_08 obj_07)
   added: (pred_3 obj_08 obj_06 obj_07)
   goals met: 1 of 3
6. (op_2 obj_08 obj_09 obj_03)
   deleted: (pred_1 obj_08 obj_09)
   added: (pred_1 obj_08 obj_03)
   goals met: 1 of 3
7. (op_3 obj_08 obj_06 obj_03 obj_07)
   deleted: (pred_3 obj_08 obj_06 obj_07)
   added: (pred_4 obj_06 obj_03) (pred_2 obj_08 obj_07)
   goals met: 2 of 3
8. (op_2 obj_08 obj_03 obj_09)
   deleted: (pred_1 obj_08 obj_03)
   added: (pred_1 obj_08 obj_09)
   goals met: 2 of 3
9. (op_1 obj_08 obj_10 obj_09 obj_07)
   deleted: (pred_4 obj_10 obj_09) (pred_2 obj_08 obj_07)
   added: (pred_3 obj_08 obj_10 obj_07)
   goals met: 2 of 3
10. (op_2 obj_08 obj_09 obj_05)
   deleted: (pred_1 obj_08 obj_09)
   added: (pred_1 obj_08 obj_05)
   goals met: 2 of 3
11. (op_3 obj_08 obj_10 obj_05 obj_07)
   deleted: (pred_3 obj_08 obj_10 obj_07)
   added: (pred_4 obj_10 obj_05) (pred_2 obj_08 obj_07)
   goals met: 3 of 3
